{
    "title": "Azure SQL",
    "icon": "devicon-azure-plain colored",
    "experience": 80,
    "overview": "Azure SQL combines the familiar SQL Server engine with cloud-native features that I leverage for scalable, managed database services.",
    "usage": "I use Azure SQL Database for cloud-first applications, taking advantage of its elastic pools, automatic scaling, and integration with other Azure services.",
    "projects": [
        "Neowire Cloud Platform",
        "Customer Analytics System",
        "Multi-tenant SaaS Application"
    ],
    "insight": "<p>Azure SQL has been instrumental in my cloud-first applications, particularly when optimizing for cost and scalability:</p><ol><li><strong>Elastic Pools:</strong> For multi-tenant applications, I group databases with unpredictable usage patterns into elastic pools to share resources efficiently</li><li><strong>Geo-replication:</strong> To support European regulatory requirements, I implemented active geo-replication across multiple regions</li><li><strong>Serverless Tier:</strong> For development environments and applications with intermittent usage, the serverless compute tier significantly reduced costs</li></ol><p>One particularly useful pattern I've implemented is automatic scaling based on workload:</p><div class=\"code-example\">// Azure Function that monitors database performance and scales as needed\nmodule.exports = async function (context, myTimer) {\n    const { ResourceManagementClient } = require(\"@azure/arm-resources\");\n    const { DefaultAzureCredential } = require(\"@azure/identity\");\n    \n    // Get current DTU usage metrics from Azure Monitor\n    const currentDtuUsage = await getDtuUsageMetrics();\n    \n    if (currentDtuUsage > 80) {\n        await scaleDatabase(\"P2\", \"Premium\");\n        context.log(\"Scaled database to P2 tier\");\n    } else if (currentDtuUsage < 30 && isBusinessHours()) {\n        await scaleDatabase(\"S1\", \"Standard\");\n        context.log(\"Scaled database to S1 tier\");\n    }\n};</div><p>This approach ensured we had performance when needed while minimizing costs during periods of lower activity.</p>"
}